/* 
টাইপস্ক্রিপ্টে Interface হলো অবজেক্টের (Object) গঠন বা শেপ নির্ধারণ করার একটি প্রফেশনাল উপায়। এটি অনেকটা Type Alias এর মতোই, কিন্তু ইন্টারফেস মূলত অবজেক্ট এবং ক্লাসের জন্য বেশি ব্যবহৃত হয়।

*/


//Example of code

// ১. ইন্টারফেস দিয়ে একটি অবজেক্টের স্ট্রাকচার বানালাম
interface IUser {
    name: string;
    age: number;
    email: string;
    role?: string; // এটি অপশনাল
}

// ২. এখন এই ইন্টারফেস ব্যবহার করে একটি ইউজার অবজেক্ট তৈরি করি
const user: IUser = {
    name: "Nayeef",
    age: 24,
    email: "nafi@diu.edu.bd"
};





/* 

(Short Note):

   i)Object Blueprint: ইন্টারফেস কাজ করে একটি নকশা বা ব্লু-প্রিন্ট হিসেবে। এটি বলে দেয় একটি অবজেক্টের ভেতর কী কী প্রপার্টি থাকবে।

   ii)Extendable: ইন্টারফেসের সবচেয়ে বড় সুবিধা হলো একে extends করে বড় করা যায় (যেমন: AdminUser ইন্টারফেস IUser কে এক্সটেন্ড করতে পারে)।

   iii)Open for Expansion: একই নামে একাধিক ইন্টারফেস লিখলে টাইপস্ক্রিপ্ট সেগুলোকে নিজে থেকেই মার্চ (Merge) করে দেয়।


   Summery : 

   i)ইন্টারফেস (Interface): এটি মূলত অবজেক্টের নকশা বা ব্লু-প্রিন্ট তৈরির জন্য সেরা। এর বিশেষ ক্ষমতা হলো Declaration Merging। অর্থাৎ, আপনি যদি একই নামে দুটি ইন্টারফেস লেখেন, টাইপস্ক্রিপ্ট সেগুলোকে নিজে থেকেই জোড়া লাগিয়ে দেয়। এটি extends কীওয়ার্ড ব্যবহার করে খুব সহজে বড় বা বিস্তার করা যায়।

   ii)টাইপ অ্যালিয়াস (Type Alias): এটি যেকোনো ধরনের টাইপের (যেমন: Union, Tuple, বা Primitive) একটি ডাকনাম দেওয়ার জন্য ব্যবহৃত হয়। এটি ইন্টারফেসের চেয়ে বেশি ফ্লেক্সিবল কারণ এটি দিয়ে type A = string | number এর মতো জটিল লজিক লেখা যায়। তবে টাইপ অ্যালিয়াসে একই নামে দ্বিতীয়বার কোনো টাইপ লিখলে এরর দেখাবে।




*/