/* 
টাইপস্ক্রিপ্টে Enum (এনাম) হলো একটি বিশেষ উপায় যার মাধ্যমে আমরা কিছু নির্দিষ্ট মানের (Constants) একটি লিস্ট তৈরি করতে পারি। এটি কোডকে আরও রিডঅ্যাবল (Readable) এবং মেনটেইনেবল করে।


🚦 Enum (Enumeration) : Enum ব্যবহার করা হয় যখন আমাদের কাছে একটি নির্দিষ্ট সেট অফ ভ্যালু থাকে (যেমন: দিনের নাম, অর্ডারের স্ট্যাটাস বা দিক-নির্দেশনা)।

*/


//Example of code

enum OrderStatus {
    Pending,   // ডিফল্ট ভ্যালু 0
    Shipped,   // ডিফল্ট ভ্যালু 1
    Delivered, // ডিফল্ট ভ্যালু 2
}

// এনাম ব্যবহার করা
let orderStat = OrderStatus.Pending;

if (orderStat === OrderStatus.Pending) {
    console.log("আপনার অর্ডারটি এখনো পেন্ডিং আছে।");
}



/* 

🔍 কীভাবে কাজ করে? : 

    ১. Numeric Enums (ডিফল্ট) : ডিফল্টভাবে এনাম নাম্বার হিসেবে কাজ করে। আপনি যদি কোনো ভ্যালু সেট না করেন, তবে এটি 0 থেকে শুরু হয়।

            i) OrderStatus.Pending এর মান 0

            ii) OrderStatus.Shipped এর মান 1

    ২. String Enums : মাঝে মাঝে নাম্বারের চেয়ে স্ট্রিং বেশি সুবিধাজনক (যেমন ডাটাবেজে সেভ করার জন্য)। তখন আপনি এভাবে লিখতে পারেন:


    Example of code for String Enums
    
    enum OrderStatus {
    Pending = "PENDING",
    Shipped = "SHIPPED",
    Delivered = "DELIVERED",
    as const;     // as const যেকোনো ভ্যালুকে Read-only করে দেয় এবং এর টাইপকে একদম নির্দিষ্ট (Literal Type) করে ফেলে যাতে ভবিষ্যতে মান পরিবর্তন করা না যায়।
}

     ৩. কেন ব্যবহার করবেন? : আপনি যদি শুধু স্ট্রিং ব্যবহার করতেন (যেমন: let status = "pending"), তবে বানানে ভুল হওয়ার সম্ভাবনা থাকতো। কিন্তু এনাম ব্যবহার করলে টাইপস্ক্রিপ্ট আপনাকে সাজেস্ট করবে এবং ভুল বানান লিখতে বাধা দিবে।


*/


/* 

সারাংশ (Summary) :

   i) Enum: এটি হলো রিলেটেড কিছু কনস্ট্যান্ট বা নির্দিষ্ট মানের একটি সেট।

   ii)সুবিধা: কোড পড়ার সময় সহজ মনে হয় (যেমন status === "pending" এর চেয়ে status === OrderStatus.Pending দেখা বেশি প্রফেশনাল)।

   iii)ডট অপারেটর: OrderStatus. লিখলেই আপনি এর ভেতরের সব অপশনগুলো দেখতে পাবেন, যা ডেভেলপমেন্ট অনেক ফাস্ট করে।


*/